Revit 2026 API

# ViewShapeBuilderValidateShape Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool ValidateShape(
	IList<GeometryObject> shape,
	DirectShapeTargetViewType targetViewType
)
```
```vb
Public Shared Function ValidateShape (
	shape As IList(Of GeometryObject),
	targetViewType As DirectShapeTargetViewType
) As Boolean
```
```cpp
public:
static bool ValidateShape(
	IList<GeometryObject^>^ shape,
	DirectShapeTargetViewType targetViewType
)
```
```fsharp
static member ValidateShape :
        shape : IList<GeometryObject> *
        targetViewType : DirectShapeTargetViewType -> bool
```

#### Parameters

shape IListGeometryObject

targetViewType DirectShapeTargetViewType

#### Return Value

Boolean

#### Reference

ViewShapeBuilder Class

Autodesk.Revit.DB Namespace